; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	infrared3 - mode
	spectrograph2 - mode
	thermograph1 - mode
	image0 - mode
	Star0 - direction
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation7 - direction
	Star10 - direction
	GroundStation11 - direction
	Star13 - direction
	GroundStation14 - direction
	Star16 - direction
	Star17 - direction
	GroundStation19 - direction
	Star18 - direction
	Star4 - direction
	GroundStation15 - direction
	GroundStation12 - direction
	GroundStation6 - direction
	GroundStation9 - direction
	GroundStation5 - direction
	GroundStation8 - direction
	Star20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Star23 - direction
	Phenomenon24 - direction
	Planet25 - direction
	Planet26 - direction
	Phenomenon27 - direction
	Planet28 - direction
	Phenomenon29 - direction
	Phenomenon30 - direction
	Phenomenon31 - direction
)
(:init
	(supports instrument0 infrared3)
	(supports instrument0 spectrograph2)
	(supports instrument0 image0)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 GroundStation15)
	(calibration_target instrument0 Star18)
	(supports instrument1 image0)
	(calibration_target instrument1 GroundStation6)
	(calibration_target instrument1 GroundStation12)
	(calibration_target instrument1 GroundStation15)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation5)
	(calibration_target instrument2 GroundStation9)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation9)
	(supports instrument3 spectrograph2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation8)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
)
(:goal (and
	(pointing satellite0 Phenomenon29)
	(have_image Star20 spectrograph2)
	(have_image Phenomenon21 infrared3)
	(have_image Planet22 thermograph1)
	(have_image Star23 image0)
	(have_image Phenomenon24 infrared3)
	(have_image Planet25 infrared3)
	(have_image Planet26 infrared3)
	(have_image Phenomenon27 spectrograph2)
	(have_image Planet28 thermograph1)
	(have_image Phenomenon29 thermograph1)
	(have_image Phenomenon30 image0)
	(have_image Phenomenon31 spectrograph2)
))

)

; plan
1. (switch_on instrument3 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument3)
   goals met: 0 of 13
2. (turn_to satellite1 groundstation8 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 groundstation8)
   goals met: 0 of 13
3. (calibrate satellite1 instrument3 groundstation8)
   added: (calibrated instrument3)
   goals met: 0 of 13
4. (turn_to satellite1 phenomenon27 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 phenomenon27)
   goals met: 0 of 13
5. (take_image satellite1 phenomenon27 instrument3 spectrograph2)
   added: (have_image phenomenon27 spectrograph2)
   goals met: 1 of 13
6. (turn_to satellite1 phenomenon29 phenomenon27)
   deleted: (pointing satellite1 phenomenon27)
   added: (pointing satellite1 phenomenon29)
   goals met: 1 of 13
7. (take_image satellite1 phenomenon29 instrument3 thermograph1)
   added: (have_image phenomenon29 thermograph1)
   goals met: 2 of 13
8. (turn_to satellite1 phenomenon31 phenomenon29)
   deleted: (pointing satellite1 phenomenon29)
   added: (pointing satellite1 phenomenon31)
   goals met: 2 of 13
9. (take_image satellite1 phenomenon31 instrument3 spectrograph2)
   added: (have_image phenomenon31 spectrograph2)
   goals met: 3 of 13
10. (turn_to satellite1 planet22 phenomenon31)
   deleted: (pointing satellite1 phenomenon31)
   added: (pointing satellite1 planet22)
   goals met: 3 of 13
11. (take_image satellite1 planet22 instrument3 thermograph1)
   added: (have_image planet22 thermograph1)
   goals met: 4 of 13
12. (turn_to satellite1 planet28 planet22)
   deleted: (pointing satellite1 planet22)
   added: (pointing satellite1 planet28)
   goals met: 4 of 13
13. (take_image satellite1 planet28 instrument3 thermograph1)
   added: (have_image planet28 thermograph1)
   goals met: 5 of 13
14. (turn_to satellite1 star20 planet28)
   deleted: (pointing satellite1 planet28)
   added: (pointing satellite1 star20)
   goals met: 5 of 13
15. (take_image satellite1 star20 instrument3 spectrograph2)
   added: (have_image star20 spectrograph2)
   goals met: 6 of 13
16. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 6 of 13
17. (calibrate satellite0 instrument2 groundstation9)
   added: (calibrated instrument2)
   goals met: 6 of 13
18. (turn_to satellite0 groundstation15 groundstation9)
   deleted: (pointing satellite0 groundstation9)
   added: (pointing satellite0 groundstation15)
   goals met: 6 of 13
19. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 6 of 13
20. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 13
21. (calibrate satellite0 instrument0 groundstation15)
   added: (calibrated instrument0)
   goals met: 6 of 13
22. (turn_to satellite0 phenomenon21 groundstation15)
   deleted: (pointing satellite0 groundstation15)
   added: (pointing satellite0 phenomenon21)
   goals met: 6 of 13
23. (take_image satellite0 phenomenon21 instrument0 infrared3)
   added: (have_image phenomenon21 infrared3)
   goals met: 7 of 13
24. (turn_to satellite0 phenomenon24 phenomenon21)
   deleted: (pointing satellite0 phenomenon21)
   added: (pointing satellite0 phenomenon24)
   goals met: 7 of 13
25. (take_image satellite0 phenomenon24 instrument0 infrared3)
   added: (have_image phenomenon24 infrared3)
   goals met: 8 of 13
26. (turn_to satellite0 phenomenon29 phenomenon24)
   deleted: (pointing satellite0 phenomenon24)
   added: (pointing satellite0 phenomenon29)
   goals met: 9 of 13
27. (turn_to satellite0 phenomenon30 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 phenomenon30)
   goals met: 8 of 13
28. (take_image satellite0 phenomenon30 instrument0 image0)
   added: (have_image phenomenon30 image0)
   goals met: 9 of 13
29. (turn_to satellite0 phenomenon29 phenomenon30)
   deleted: (pointing satellite0 phenomenon30)
   added: (pointing satellite0 phenomenon29)
   goals met: 10 of 13
30. (turn_to satellite0 planet25 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 planet25)
   goals met: 9 of 13
31. (take_image satellite0 planet25 instrument0 infrared3)
   added: (have_image planet25 infrared3)
   goals met: 10 of 13
32. (turn_to satellite0 phenomenon29 planet25)
   deleted: (pointing satellite0 planet25)
   added: (pointing satellite0 phenomenon29)
   goals met: 11 of 13
33. (turn_to satellite0 planet26 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 planet26)
   goals met: 10 of 13
34. (take_image satellite0 planet26 instrument0 infrared3)
   added: (have_image planet26 infrared3)
   goals met: 11 of 13
35. (turn_to satellite0 phenomenon29 planet26)
   deleted: (pointing satellite0 planet26)
   added: (pointing satellite0 phenomenon29)
   goals met: 12 of 13
36. (turn_to satellite0 star23 phenomenon29)
   deleted: (pointing satellite0 phenomenon29)
   added: (pointing satellite0 star23)
   goals met: 11 of 13
37. (take_image satellite0 star23 instrument0 image0)
   added: (have_image star23 image0)
   goals met: 12 of 13
38. (turn_to satellite0 phenomenon29 star23)
   deleted: (pointing satellite0 star23)
   added: (pointing satellite0 phenomenon29)
   goals met: 13 of 13
